In [1]:
import pandas as pd

In [2]:
india_weather = pd.DataFrame({
    "city" : ["mumbai","delhi","banglore"],
    "temperature" : [32,45,30],
    "humidity" : [80,60,78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [3]:
us_weather = pd.DataFrame({
    "city" : ["new york","chicago","orlando"],
    "temperature" : [21,15,30],
    "humidity" : [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           15        65
2   orlando           30        75

In [6]:
df = pd.concat([india_weather,us_weather], axis =0)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           15        65
2   orlando           30        75

In [7]:
df = pd.concat([india_weather,us_weather],ignore_index = True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           15        65
5   orlando           30        75

In [8]:
df = pd.concat([india_weather,us_weather],keys = ["india","us"])
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0  new york           21        68
      1   chicago           15        65
      2   orlando           30        75

In [14]:

df.loc[["us"]], df.loc[["india"]]

(          city  temperature  humidity
 us 0  new york           21        68
    1   chicago           15        65
    2   orlando           30        75,
              city  temperature  humidity
 india 0    mumbai           32        80
       1     delhi           45        60
       2  banglore           30        78)

In [15]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [16]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
}, index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [17]:
df= pd.concat([temperature_df,windspeed_df],axis = 1)
df

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           30     NaN        NaN

In [21]:
df= pd.merge(temperature_df,windspeed_df,on = "city") # default inner join
df

     city  temperature  windspeed
0  mumbai           32         12
1   delhi           45          7

In [23]:
df= pd.merge(temperature_df,windspeed_df,on = "city", how = "left")
df

       city  temperature  windspeed
0    mumbai           32       12.0
1     delhi           45        7.0
2  banglore           30        NaN

In [24]:
df= pd.merge(temperature_df,windspeed_df,on = "city", how = "right")
df

     city  temperature  windspeed
0   delhi           45          7
1  mumbai           32         12